spec/spec/SVWS/IntegrationPlatform/Examples/CreateVirtualCardWithAccountRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
        <CardAcctRelAddRq>
            <RqUID>A5d0f00502f1126005f00000f00e0000e011</RqUID>
            <MsgRqHdr>
                <ContextRqHdr>
                    <NetworkTrnData>
                        <NetworkOwner>Branch</NetworkOwner>
                        <TerminalIdent>10000007</TerminalIdent>
                    </NetworkTrnData>
                    <ClientDt>2014-06-02T07:45:45</ClientDt>
                </ContextRqHdr>
            </MsgRqHdr>
      
            <CardAcctRelInfo>
                <CardRef>
                    <CardInfo>
                        <CardNum>5436380000000025</CardNum>
                        <Brand>MasterCard</Brand>
                        <CardTechnology>Virtual</CardTechnology>
                        <ExpDt>2016-03-07T00:00:00</ExpDt>
                        <CardCategory>Virtual</CardCategory>
                        <CardTrnLimit>
                            <TrnType />
                            <LimitType>Max</LimitType>
                            <CurAmt>
                                <Amt>350000</Amt>
                                <CurCode>
                                    <CurCodeValue>USD</CurCodeValue>
                                </CurCode>
                            </CurAmt>
                        </CardTrnLimit>
                    </CardInfo>
                </CardRef>
                <AcctRef>
                    <AcctInfo>
                        <AcctIdent>
                            <AcctIdentType>AcctNum</AcctIdentType>
                            <AcctIdentValue>1001840500000000001</AcctIdentValue>
                        </AcctIdent>  
                    </AcctInfo>
                </AcctRef>
                <CardAcctPriority>1</CardAcctPriority>
            </CardAcctRelInfo>
        </CardAcctRelAddRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>